///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при определении сервисов, которые поддерживают миграцию.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//   Сервисы - СписокЗначений - в качестве значения адрес сервиса, в качестве представления - представление сервиса.
//
Процедура ПриОпределенииСервисов(Сервисы) Экспорт
КонецПроцедуры

// Обработчик при выгрузке данных.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//   Объект - КонстантаМенеджерЗначения
//          - СправочникОбъект
//          - ДокументОбъект
//          - ПланСчетовОбъект
//          - ПланВидовХарактеристикОбъект
//          - ПланВидовРасчетаОбъект
//          - РегистрСведенийНаборЗаписей
//          - РегистрНакопленияНаборЗаписей
//          - РегистрБухгалтерииНаборЗаписей
//          - РегистрРасчетаНаборЗаписей
//          - ПоследовательностьНаборЗаписей
//          - ПерерасчетНаборЗаписей
//          - БизнесПроцессОбъект
//          - ЗадачаОбъект - выгружаемый объект.
//   Отказ - Булево - если данному параметру установить значение Истина, то объект не будет выгружен.
//
Процедура ПриВыгрузкеОбъекта(Объект, Отказ) Экспорт
КонецПроцедуры

// Обработчик при загрузке данных.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//   Объект - КонстантаМенеджерЗначения
//          - СправочникОбъект
//          - ДокументОбъект
//          - ПланСчетовОбъект
//          - ПланВидовХарактеристикОбъект
//          - ПланВидовРасчетаОбъект
//          - РегистрСведенийНаборЗаписей
//          - РегистрНакопленияНаборЗаписей
//          - РегистрБухгалтерииНаборЗаписей
//          - РегистрРасчетаНаборЗаписей
//          - ПоследовательностьНаборЗаписей
//          - ПерерасчетНаборЗаписей
//          - БизнесПроцессОбъект
//          - ЗадачаОбъект - загружаемый объект.
//   Отказ - Булево - если данному параметру установить значение Истина, то объект не будет загружен.
//
Процедура ПриЗагрузкеОбъекта(Объект, Отказ) Экспорт
КонецПроцедуры

#КонецОбласти
	
