///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для документов "_Демо".

Процедура _ДемоЗаполнитьДатуДокументаПоРабочейДатеОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура _ДемоЗаполнитьДатуДокументаПоРабочейДатеПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура _ДемоОбновитьРеестрСкладскихДокументовПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений._ДемоРеестрСкладскихДокументов.ОбновитьРеестрСкладскихДокументов(Источник);
	
КонецПроцедуры

#КонецОбласти
