///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Для внутреннего использования.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  КонечнаяТочка - ПланОбменаСсылка.ОбменСообщениями - конечная точка,
//  ПараметрыАутентификации - Строка - пароль, или
//                          - Структура:
//                * ИспользоватьТекущегоПользователя - Булево
//                * Пароль - Строка - не обязательный.
//		
// Возвращаемое значение:
//  Структура:
//    * ВидТранспортаСообщенийОбменаПоУмолчанию - ПеречислениеСсылка.ВидыТранспортаСообщенийОбмена
//    * WSURLВебСервиса - Строка
//    * WSИмяПользователя - Строка
//    * WSЗапомнитьПароль - Булево
//    * WSПароль - Строка
//
Функция НастройкиТранспортаWS(КонечнаяТочка, ПараметрыАутентификации = Неопределено) Экспорт
КонецФункции

#КонецОбласти

#КонецЕсли