///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура Добавить(Сертификат, ТипХранилища) Экспорт

	ХранилищеСертификатов.Добавить(Сертификат, ТипХранилища);
	
КонецПроцедуры

Функция Получить(ТипХранилища = Неопределено) Экспорт
	
	Возврат ХранилищеСертификатов.Получить(ТипХранилища);
	
КонецФункции

Функция НайтиСертификат(Сертификат) Экспорт
	
	Возврат ХранилищеСертификатов.НайтиСертификат(Сертификат);
	
КонецФункции

#КонецОбласти