///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Одиночный параметр
	НаборСсылок = Новый Массив;
	НаборСсылок.Добавить(ПараметрКоманды);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Владелец", ПараметрыВыполненияКоманды.Источник);
	ПараметрыОткрытия.Вставить("Уникальность", ПараметрыВыполненияКоманды.Уникальность);
	ПараметрыОткрытия.Вставить("Окно", ПараметрыВыполненияКоманды.Окно);
	ПараметрыОткрытия.Вставить("НавигационнаяСсылка", ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ПоискИУдалениеДублейКлиент.ПоказатьМестаИспользования(НаборСсылок, ПараметрыОткрытия);
КонецПроцедуры

#КонецОбласти
