///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодпискиБСП() Экспорт
	
	Подписки = ИнтеграцияПодсистемБТСКлиент.СобытияБТС();
	ИнтеграцияПодсистемБСПКлиент.ПриОпределенииПодписокНаСобытияБТС(Подписки);
	
	Возврат Подписки;
	
КонецФункции

#КонецОбласти