///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ПравоЗапуск() Экспорт
	
	Возврат НСтр("ru = 'Запуск'");
	
КонецФункции

Функция ПравоЗапускИАдминистрирование() Экспорт
	
	Возврат НСтр("ru = 'Запуск и администрирование'");
	
КонецФункции

Функция РольВладелец() Экспорт
	
	Возврат НСтр("ru = 'Владелец'");
	
КонецФункции

Функция РольАдминистратор() Экспорт
	
	Возврат НСтр("ru = 'Администратор'");
	
КонецФункции

Функция РольПользователь() Экспорт
	
	Возврат НСтр("ru = 'Пользователь'");
	
КонецФункции

Функция ПредставлениеРоли(Идентификатор) Экспорт
	
	Если Идентификатор = "owner" Тогда
		Возврат РольВладелец();
	ИначеЕсли Идентификатор = "administrator" Тогда
		Возврат РольАдминистратор();
	ИначеЕсли Идентификатор = "user" Тогда  
		Возврат РольПользователь();
	ИначеЕсли Идентификатор = "operator" Тогда
		Возврат РольОператор();
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторAPIРоли(Представление) Экспорт
	
	Если Представление = РольВладелец() Тогда
		Возврат "owner";
	ИначеЕсли Представление = РольАдминистратор() Тогда
		Возврат "administrator";
	ИначеЕсли Представление = РольПользователь() Тогда
		Возврат "user";
	ИначеЕсли Представление = РольОператор() Тогда
		Возврат "operator";
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторAPIПрава(Представление) Экспорт
	
	Если Представление = ПравоЗапуск() Тогда
		Возврат "user";
	ИначеЕсли Представление = ПравоЗапускИАдминистрирование() Тогда
		Возврат "administrator";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РольОператор()
	
	Возврат НСтр("ru = 'Оператор'");
	
КонецФункции

#КонецОбласти
