
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		Расписание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСписка.Ключ, "Расписание").Получить();
		
		Если Расписание = Неопределено Тогда
			ПредставлениеРасписания = НСтр("ru = 'Не задано'");
			Использование = Ложь;
		Иначе
			ПредставлениеРасписания = Строка(Расписание);
			Использование = СтрокаСписка.Значение.Данные.Использование;
		КонецЕсли;
		
		Оформление = СтрокаСписка.Значение.Оформление.Получить("ПредставлениеРасписания");
		Если Оформление <> Неопределено Тогда
			Оформление.УстановитьЗначениеПараметра("Текст", ПредставлениеРасписания);
		КонецЕсли;
		
		Если Не Использование Тогда
			Для Каждого ОФормление Из СтрокаСписка.Значение.Оформление Цикл
				ОФормление.Значение.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
