///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеПоИмени(ИмяЗначения) Экспорт
    
    Если ИмяЗначения = "unlimited" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Безлимитная");
    ИначеЕсли ИмяЗначения = "limited" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Лимитированная");
    ИначеЕсли ИмяЗначения = "unique" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Уникальная");
    Иначе
        Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.ПустаяСсылка");
    КонецЕсли; 
    
КонецФункции

#КонецОбласти

#КонецЕсли