///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ПараметрыЗадания - СправочникСсылка.ОбработчикиОчередиЗаданий - параметры задания.
//
Процедура ОбработкаОчередиЗаданийБТС(ПараметрыЗадания) Экспорт
КонецПроцедуры

// Производит планирование выполнения заданий из РС ОчередьЗаданий.
// @skip-warning ПустойМетод - особенность реализации.
// 
Процедура ПланированиеОбработкиЗаданий() Экспорт
КонецПроцедуры

// Процедура выполняет задания из РС ОчередьЗаданий. Отличие от процедуры "ОбработатьОчередьЗаданий" в том,
//	данная процедуры вызывается рег.заданием
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры: 
//   Задание - СправочникСсылка - ссылка на задание которое требуется выполнить в рамках данной итерации
//
Процедура РегламентнаяОбработкаОчередиЗаданий(Задание) Экспорт
КонецПроцедуры

// @skip-warning ПустойМетод - особенность реализации.
// Возвращаемое значение:
//  Массив - массив имен методов.
//
Функция ВозможныеМетоды() Экспорт
КонецФункции

// См. РаботаВМоделиСервисаПереопределяемый.ПриВключенииРазделенияПоОбластямДанных
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт
КонецПроцедуры

// См. ЗагрузкаДанныхИзФайлаПереопределяемый.ПриОпределенииСправочниковДляЗагрузкиДанных
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
КонецПроцедуры

// @skip-warning ПустойМетод - особенность реализации.
Процедура ЗапускОбработкиЗаданий() Экспорт
	
КонецПроцедуры


#КонецОбласти
