///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ПрограммныйИнтерфейс

// Выбирает справочник для добавляемого задания очереди заданий.
//
// Параметры:
//  ПараметрыЗадания - Структура - параметры добавляемого задания, возможные ключи:
//   * ОбластьДанных - Число - область данных
//   * Использование - Булево - факт использования
//   * ЗапланированныйМоментЗапуска - Дата - дата начала запуска
//   * ЭксклюзивноеВыполнение - Булево - факт эксклюзивного выполнения
//   * ИмяМетода - Строка - имя метода для задания (обязательно для указания.)
//   * Параметры - Массив - массив параметров задания
//   * Ключ - Строка - ключ задания
//   * ИнтервалПовтораПриАварийномЗавершении - Число - указывается в секундах
//   * Расписание - РасписаниеРегламентногоЗадания - расписания выполнения задания
//   * КоличествоПовторовПриАварийномЗавершении - Число - количество повторов.
//	 
// Возвращаемое значение:
//  СправочникМенеджер.ОчередьЗаданийОбластейДанных - менеджер.
//
Функция ПриВыбореСправочникаДляЗадания(Знач ПараметрыЗадания) Экспорт
	
	Если ПараметрыЗадания.Свойство("ОбластьДанных") И ПараметрыЗадания.ОбластьДанных <> -1 Тогда
		
		Возврат Справочники.ОчередьЗаданийОбластейДанных;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
