///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает новую структуру описания возвращаемых данных.
// @skip-warning ПустойМетод - особенность реализации.
// 
// Возвращаемое значение:
//  Структура:
//   * МодульМенеджер - ОбщийМодуль
//                    - СправочникиМенеджер
//                    - ОтчетыМенеджер - модуль менеджера получения данных.
//   * Наименование - Строка - наименование возвращаемых данных.
//   * Описание - Строка - подробное описание возвращаемых данных.
//   * ТипыРезультата - Массив - типы возвращаемых данных.
//	 
Функция НовыйОписаниеВозвращаемыхДанных() Экспорт
КонецФункции

// Возвращает перечень доступных данных
// @skip-warning ПустойМетод - особенность реализации.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - перечень доступных возвращаемых данных:
//   * Ключ - Строка - идентификатор данных.
//   * Значение - см. АсинхронноеПолучениеДанных.НовыйОписаниеВозвращаемыхДанных
//	
Функция ДоступныеВозвращаемыеДанные() Экспорт
КонецФункции

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
КонецПроцедуры

#Область ОбработчикиОчередиЗаданий

// Формирует данные для ответа по полученным параметрам.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИдентификаторДанных - Строка - идентификатор данных, которые нужно получить.
//  ИдентификаторПараметров - УникальныйИдентификатор - идентификатор файла параметров получения данных.
//
Процедура ПодготовитьДанные(ИдентификаторДанных, ИдентификаторПараметров) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецОбласти
 
