///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет дополнить, изменить данные перед отправкой в менеджер сервиса.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила. 
//  Данные - Структура - данные к отправке. 
//
Процедура ОбработатьДанныеПередОтправкой(ИдентификаторПравила, Данные) Экспорт
КонецПроцедуры

// Процедура обработки оповещения об изменении объекта. 
// Вызывается после получения данных объекта, перед сохранением объекта в безопасное хранилище.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила.
//  КлючОбъекта - Строка - ключ объекта. 
//  Данные - Структура - данные объекта.
//
Процедура ОбработатьОповещениеОбИзменении(ИдентификаторПравила, КлючОбъекта, Данные) Экспорт
КонецПроцедуры
 
#КонецОбласти 
