///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// @skip-warning ПустойМетод - особенность реализации.
// Возвращаемое значение:
//  ПланОбменаСсылка.ОбменСообщениями - ссылка на узел.
//
Функция ЭтотУзел() Экспорт
КонецФункции

// См. ОбменДаннымиПереопределяемый.ПриВыгрузкеДанных
// @skip-warning ПустойМетод - особенность реализации.
// 
Процедура ПриВыгрузкеДанных(СтандартнаяОбработка, Получатель, ИмяФайлаСообщения,
		ДанныеСообщения, КоличествоЭлементовВТранзакции,
		ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов) Экспорт
КонецПроцедуры

// См. ОбменДаннымиПереопределяемый.ПриЗагрузкеДанных
// @skip-warning ПустойМетод - особенность реализации.
// 
Процедура ПриЗагрузкеДанных(СтандартнаяОбработка, Отправитель,
		ИмяФайлаСообщения, ДанныеСообщения, КоличествоЭлементовВТранзакции,
		ИмяСобытияЖурналаРегистрации, КоличествоПолученныхОбъектов) Экспорт
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
КонецПроцедуры

// См. ГрупповоеИзменениеОбъектовПереопределяемый.ПриОпределенииОбъектовСРедактируемымиРеквизитами
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты) Экспорт
КонецПроцедуры

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	Если РаботаВМоделиСервисаПовтИсп.ЭтоРазделеннаяКонфигурация() Тогда
		Типы.Добавить(Метаданные.Справочники.СообщенияОбластейДанных);
	КонецЕсли;
	
	Типы.Добавить(Метаданные.Справочники.СообщенияСистемы);
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов.ПоддерживаемыеВерсии
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(Знач СтруктураПоддерживаемыхВерсий) Экспорт
КонецПроцедуры

// Устанавливает код этой конечной точки, если не установлен.
// @skip-warning ПустойМетод - особенность реализации.
// 
Процедура УстановитьКодЭтойКонечнойТочки() Экспорт
КонецПроцедуры

// Переносит настройки транспорта обмена сообщениями в новый регистр.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПеренестиНастройкиТранспортаОбменаСообщениями() Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик регламентного задания для отправки и получения сообщений системы.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ОтправитьИПолучитьСообщенияПоРегламентномуЗаданию() Экспорт
КонецПроцедуры

#КонецОбласти

