///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Получение обновлений программы".
// ОбщийМодуль.ПолучениеОбновленийПрограммыКлиентПереопределяемый.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет необходимость показа всплывающего оповещения о
// доступном обновлении программы. Вызывается только при наличии
// встроенной подсистемы СтандартныеПодсистемы.ТекущиеДела.
//
// Параметры:
//	Использование - Булево - в параметре возвращается признак необходимости
//		показа оповещения. Истина- показать, Ложь - в противном случае.
//		Значение по умолчанию - Ложь.
//
//@skip-warning
Процедура ПриОпределенииНеобходимостиПоказаОповещенийОДоступныхОбновлениях(Использование) Экспорт
	
	
КонецПроцедуры

#КонецОбласти
