///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует печатную форму карточки конфигурации и открывает ее в форме ПечатьДокументов.
//
// Параметры:
//  ПараметрыПечати - см. УправлениеПечатьюКлиент.ОписаниеПараметровПечати
//
// Возвращаемое значение:
//  Неопределено - возвращать результат не требуется.
//
&НаКлиенте
Функция ПечатьКарточкиОрганизации(ПараметрыПечати) Экспорт
	
	ОбластиОбъектов = Новый СписокЗначений;
	ТабличныйДокумент = СформироватьКарточкуОрганизации(ПараметрыПечати.ОбъектыПечати, ОбластиОбъектов);
	
	ИдентификаторПечатнойФормы = "КарточкаОрганизации";
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Карточка организации'");
	ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НСтр("ru = 'Карточка организации'");
	
	ДополнительныеПараметры = УправлениеПечатьюКлиент.ПараметрыПечати();
	ДополнительныеПараметры.ЗаголовокФормы = НСтр("ru = 'Карточка организации'");
	ДополнительныеПараметры.ВладелецФормы = ПараметрыПечати.Форма;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов, ДополнительныеПараметры);
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СформироватьКарточкуОрганизации(СписокОрганизаций, ОбластиОбъектов)
	Возврат Обработки._ДемоПечатьКарточкиОрганизации.СформироватьКарточкуОрганизации(СписокОрганизаций, ОбластиОбъектов);
КонецФункции

#КонецОбласти
