///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ПрограммныйИнтерфейс

// Вызывается при формировании списка доступных возвращаемых данных и при получении данных. 
// Определяет список возвращаемых данных, подключенных к подсистеме.
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  ДоступныеВозвращаемыеДанные - Соответствие из КлючИЗначение - заполняемые доступные возвращаемые данные:
//    * Ключ - Строка - идентификатор данных.
//    * Значение - см. АсинхронноеПолучениеДанных.НовыйОписаниеВозвращаемыхДанных
//
Процедура УстановитьДоступныеВозвращаемыеДанные(ДоступныеВозвращаемыеДанные) Экспорт
КонецПроцедуры

// Вызывается при первичной обработке входящего запроса. Позволяет выполнить прикладную логику,
// связанную с валидацией входящего запроса и при необходимости отказать в обработке запроса.
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  ИдентификаторДанных - Строка - идентификатор данных. Может быть переопределено при обработке.
//                                 Указывается в качестве имени файла, возвращаемом в результате.
//  Параметры - ДвоичныеДанные - переданные параметры получения данных.
//  Отказ - Булево - возвращаемый параметр. Признак отказа в авторизации. При отказе в авторизации устанавливать в
//                   Отказ = Истина.
//  СообщениеОбОшибке - Строка - возвращаемый параметр. Текст сообщения об ошибке при отказе в авторизации.
//  
Процедура АвторизоватьЗапрос(ИдентификаторДанных, Параметры, Отказ, СообщениеОбОшибке) Экспорт
КонецПроцедуры

#КонецОбласти