///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийКонтейнер;
Перем ТекущееИмяХранилищаНастроек;
Перем ТекущееХранилищеНастроек;
Перем ТекущиеОбработчики;
Перем ТекущийПотокЗаменыСсылок;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура Инициализировать(Контейнер, ИмяХранилищаНастроек, Обработчики, ПотокЗаменыСсылок) Экспорт
	
	ТекущийКонтейнер = Контейнер;
	ТекущиеОбработчики = Обработчики;
	ТекущийПотокЗаменыСсылок = ПотокЗаменыСсылок;
	
	ТекущееИмяХранилищаНастроек = ИмяХранилищаНастроек;
	ТекущееХранилищеНастроек = ОбщегоНазначения.ВычислитьВБезопасномРежиме(ТекущееИмяХранилищаНастроек);
	
КонецПроцедуры

// Загружает настройки пользователей.
//
// Параметры:
//   СопоставлениеПользователей - Соответствие из КлючИЗначение - коллекция пользователей, настройки которых нужно загрузить. 
//                                     Если не указано, то загружаются все настройки "как есть":
//                                       *Ключ - старое имя пользователя
//                                       *Значение - новое имя пользователя.
//
Процедура ЗагрузитьДанные(СопоставлениеПользователей = Неопределено) Экспорт
	
	Отказ = Ложь;
	ТекущиеОбработчики.ПередЗагрузкойХранилищаНастроек(
		ТекущийКонтейнер,
		ТекущееИмяХранилищаНастроек,
		ТекущееХранилищеНастроек,
		Отказ);
	
	Если Не Отказ Тогда
		
		ЗагрузитьНастройкиВСтандартноеХранилище(СопоставлениеПользователей);
		
	КонецЕсли;
	
	ТекущиеОбработчики.ПослеЗагрузкиХранилищаНастроек(
		ТекущийКонтейнер,
		ТекущееИмяХранилищаНастроек,
		ТекущееХранилищеНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьНастройкиВСтандартноеХранилище(СопоставлениеПользователей)
	
	Для Каждого ОписаниеФайла Из ТекущийКонтейнер.ПолучитьОписанияФайловИзКаталога(ВыгрузкаЗагрузкаДанныхСлужебный.UserSettings(), ТекущееИмяХранилищаНастроек) Цикл
		
		ТекущийКонтейнер.РаспаковатьФайл(ОписаниеФайла);
		
	    ТекущийПотокЗаменыСсылок.ВыполнитьЗаменуСсылокВФайле(ОписаниеФайла);
	
		ПотокЧтения = Обработки.ВыгрузкаЗагрузкаДанныхПотокЧтенияДанныхИнформационнойБазы.Создать();
		ПотокЧтения.ОткрытьФайл(ОписаниеФайла.ПолноеИмя);
		
		Пока ПотокЧтения.ПрочитатьОбъектДанныхИнформационнойБазы() Цикл
			
			Отказ = Ложь;
			
			ЗаписьНастроек = ПотокЧтения.ТекущийОбъект();
			Артефакты = ПотокЧтения.АртефактыТекущегоОбъекта();
			
			КлючНастроек = ЗаписьНастроек.КлючНастроек;
			КлючОбъекта = ЗаписьНастроек.КлючОбъекта;
			Пользователь = ЗаписьНастроек.Пользователь;
			Представление = ЗаписьНастроек.Представление;
			
			Если СопоставлениеПользователей <> Неопределено Тогда
				Пользователь = СопоставлениеПользователей.Получить(Пользователь);
				Если Не ЗначениеЗаполнено(Пользователь) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаписьНастроек.СериализацияЧерезХранилищеЗначения Тогда
				Настройки = ЗаписьНастроек.Настройки.Получить();
			Иначе
				Настройки = ЗаписьНастроек.Настройки;
			КонецЕсли;
			
			ТекущиеОбработчики.ПередЗагрузкойНастроек(
				ТекущийКонтейнер,
				ТекущееИмяХранилищаНастроек,
				КлючНастроек,
				КлючОбъекта,
				Настройки,
				Пользователь,
				Представление,
				Артефакты,
				Отказ);
			
			Если Не Отказ Тогда
				
				ОписаниеНастроек = Новый ОписаниеНастроек;
				ОписаниеНастроек.Представление = Представление;
				
				ТекущееХранилищеНастроек.Сохранить(
					КлючОбъекта,
					КлючНастроек,
					Настройки,
					ОписаниеНастроек,
					Пользователь);
				
			КонецЕсли;
			
			ТекущиеОбработчики.ПослеЗагрузкиНастроек(
				ТекущийКонтейнер,
				ТекущееИмяХранилищаНастроек,
				КлючНастроек,
				КлючОбъекта,
				Настройки,
				Пользователь,
				Представление,
				Артефакты);
			
		КонецЦикла;
		
		ПотокЧтения.Закрыть();
		УдалитьФайлы(ОписаниеФайла.ПолноеИмя);	
			
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли