///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает менеджеры логических хранилищ.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение - менеджеры логических хранилищ:
//    * Ключ - Строка - идентификатор логического хранилища;
//    * Значение - ОбщийМодуль - менеджер логического хранилища.
//
Функция ВсеМенеджерыЛогическихХранилищ() Экспорт
	
	Возврат ПередачаДанныхПовтИсп.МенеджерыЛогическихХранилищ();
	
КонецФункции

// Возвращает менеджеры физических хранилищ.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение - менеджеры физических хранилищ:
//    * Ключ - Строка - идентификатор физического хранилища;
//    * Значение - ОбщийМодуль - менеджер физического хранилища.
//
Функция ВсеМенеджерыФизическихХранилищ() Экспорт
	
	Возврат ПередачаДанныхПовтИсп.МенеджерыФизическихХранилищ();
	
КонецФункции

// Получает данные из логического хранилища.
//
// Параметры:
//   ПараметрыДоступа - Структура:
//     * URL - Строка - URL сервиса, обязательно должно присутствовать и быть заполненным;
//     * UserName - Строка - имя пользователя;
//     * Password - Строка - пароль пользователя.
//   ИдентификаторХранилища - Строка - идентификатор логического хранилища.
//   Идентификатор - Строка - идентификатор данных в логическом хранилище.
//
// Возвращаемое значение:
//   Структура:
//     * Имя - Строка - имя файла;
//     * ПолноеИмя - Строка - полное имя файла (включающее путь к файлу).
//
Функция ПолучитьИзЛогическогоХранилища(ПараметрыДоступа, ИдентификаторХранилища, Идентификатор) Экспорт
	
	Возврат ПередачаДанныхСлужебный.Получить(ПараметрыДоступа, Ложь, ИдентификаторХранилища, Идентификатор);
	
КонецФункции

// Получает данные из физического хранилища.
//
// Параметры:
//   ПараметрыДоступа - Структура:
//     * URL - Строка - URL сервиса, обязательно должно присутствовать и быть заполненным;
//     * UserName - Строка - имя пользователя;
//     * Password - Строка - пароль пользователя.
//   ИдентификаторХранилища - Строка - идентификатор физического хранилища.
//   Идентификатор - Строка - идентификатор данных в физическом хранилище.
//
// Возвращаемое значение:
//   Структура:
//     * Имя - Строка - имя файла;
//     * ПолноеИмя - Строка - полное имя файла (включающее путь к файлу).
//
Функция ПолучитьИзФизическогоХранилища(ПараметрыДоступа, ИдентификаторХранилища, Идентификатор) Экспорт
	
	Возврат ПередачаДанныхСлужебный.Получить(ПараметрыДоступа, Истина, ИдентификаторХранилища, Идентификатор);
	
КонецФункции

// Отправляет данные в логическое хранилище.
//
// Параметры:
//   ПараметрыДоступа - Структура:
//     * URL - Строка - URL сервиса, обязательно должно присутствовать и быть заполненным;
//     * UserName - Строка - имя пользователя;
//     * Password - Строка - пароль пользователя.
//   ИдентификаторХранилища - Строка - идентификатор логического хранилища.
//   Данные - Строка - адрес данных во временном хранилище;
//          - Строка - полное имя файла (включающее путь к файлу);
//          - Файл - файловый объект;
//          - ДвоичныеДанные - значение в виде двоичных данных.
//   ИмяФайла - Строка - имя передаваемого файла.
//   ДополнительныеПараметры - Структура - структура со значениями сериализуемыми в json.
//
Функция ОтправитьВЛогическоеХранилище(ПараметрыДоступа, ИдентификаторХранилища, Данные, Знач ИмяФайла, ДополнительныеПараметры = Неопределено) Экспорт
	
	Возврат ПередачаДанныхСлужебный.Отправить(ПараметрыДоступа, Ложь, ИдентификаторХранилища, Данные, ИмяФайла, ДополнительныеПараметры);
	
КонецФункции

// Отправляет данные в физическое хранилище.
//
// Параметры:
//   ПараметрыДоступа - Структура:
//     * URL - Строка - URL сервиса, обязательно должно присутствовать и быть заполненным;
//     * UserName - Строка - имя пользователя;
//     * Password - Строка - пароль пользователя.
//   ИдентификаторХранилища - Строка - идентификатор физического хранилища.
//   Данные - Строка - адрес данных во временном хранилище;
//          - Строка - полное имя файла (включающее путь к файлу);
//          - Файл - файловый объект;
//          - ДвоичныеДанные - значение в виде двоичных данных.
//   ИмяФайла - Строка - имя передаваемого файла.
//
Функция ОтправитьВФизическоеХранилище(ПараметрыДоступа, ИдентификаторХранилища, Данные, Знач ИмяФайла) Экспорт
	
	Возврат ПередачаДанныхСлужебный.Отправить(ПараметрыДоступа, Истина, ИдентификаторХранилища, Данные, ИмяФайла);
	
КонецФункции

#КонецОбласти