///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types

#Область ПрограммныйИнтерфейс

// Создает ключевую пару и формирует данные для запроса на сертификат
//
// Параметры:
//   ОповещениеОЗавершении - ОписаниеОповещения - описание процедуры, принимающей результат:
//     * Результат - Структура - результат выполнения процедуры:
//       ** Выполнено      		- Булево - если Истина, то процедура успешно выполнена и получен результат, 
//       						  иначе, подробности в ИнформацияОбОшибке.
//       ** ОписаниеОшибки 		- ИнформацияОбОшибке - описание ошибки выполнения, в случае возникновения ошибки, 
//								  нижеописанные поля не формируются.
//       ** ЗапросСертификата 	- ДвоичныеДанные - файлов в формате PKCS10
//       ** ОткрытыйКлюч 		- ДвоичныеДанные - данные ключа
//       ** ИмяПровайдера 		- Строка - содержит имя провайдера использованный для генерации ключа
//       ** ТипПровайдера 		- Число - тип провайдера использованный для генерации ключа
//   ИдентификаторЗаявления		- Строка - длинна - 36 - обычно уникальный идентификатор, используется для последующей установки сертификата
//   СодержаниеЗапроса 			- Строка - описание полей для запроса на сертификат
//   ИдентификаторАбонента 		- Строка - длинна - 36 - уникальный идентификатор
//   НотариусАдвокатГлаваКФХ	- Булево - используется при формировании ОГРН
//
Процедура СоздатьКонтейнерИЗапросНаСертификат(ОповещениеОЗавершении, 
										ИдентификаторЗаявления, 
										СодержаниеЗапроса, 
										ИдентификаторАбонента = Неопределено,
										НотариусАдвокатГлаваКФХ = Ложь) Экспорт
	
	МенеджерСервисаКриптографииСлужебныйКлиент.СоздатьКонтейнерИЗапросНаСертификат(
			ОповещениеОЗавершении,
			ИдентификаторЗаявления,
			СодержаниеЗапроса,
			ИдентификаторАбонента,
			НотариусАдвокатГлаваКФХ);
	
КонецПроцедуры

// Устанавливает сертификат в защищенном хранилище
//
// Параметры:
//   ОповещениеОЗавершении - ОписаниеОповещения - описание процедуры, принимающей результат:
//     * Результат - Структура - результат выполнения процедуры:
//       ** Выполнено      	- Булево - если Истина, то процедура успешно выполнена и получен результат, иначе см. ИнформацияОбОшибке.
//       ** ОписаниеОшибки 	- ИнформацияОбОшибке - описание ошибки выполнения, в случае возникновения ошибки.
//   ИдентификаторЗаявления - Строка - длинна - 36 - обычно уникальный идентификатор, используется сопоставления
//                                     закрытого ключа.
//   ДанныеСертификата 		- ДвоичныеДанные - в кодировке DER или PEM
//
Процедура УстановитьСертификатВКонтейнерИХранилище(ОповещениеОЗавершении, 
												ИдентификаторЗаявления, 
												ДанныеСертификата) Экспорт
	
	МенеджерСервисаКриптографииСлужебныйКлиент.УстановитьСертификатВКонтейнерИХранилище(
			ОповещениеОЗавершении,
			ИдентификаторЗаявления,
			ДанныеСертификата);
		
КонецПроцедуры

#КонецОбласти