///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ПодключениеСервисовСопровожденияКлиентСервер.
//
// Клиент-серверные процедуры и функции подключения тестовых периодов.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Создает новые параметры формы обработки ПодключениеСервисовСопровождения.Формы.ПодключениеТестовогоПериода,
// которые используются для отображения состояния подключения.
//
// Параметры
//  ИдентификаторТестовогоПериода - Строка - уникальный идентификатор тестового периода;
//  Наименование                  - Строка - наименование тестового периода;
//  Идентификатор                 - Строка - уникальный идентификатор тестового периода;
//  ИдентификаторЗапроса          - Строка - идентификатор запроса на подключение;
//  ОписаниеОшибки                - Строка - описание ошибки при подключении;
//  СостояниеПодключения          - Перечисление.СостоянияПодключенияСервисов - состояние запроса на подключение;
//  РежимРегламентногоЗадания     - Булево - если истина, после получения подтверждения,
//                                  будет удалена информация о запросе и регламентное задание.
//
// Возвращаемое значение:
//   Структура - параметры формы.
//
Функция НовыйПараметрыФормыОтобразитьРезультат(
		ИдентификаторТестовогоПериода,
		Наименование,
		Идентификатор,
		ИдентификаторЗапроса,
		ОписаниеОшибки,
		СостояниеПодключения = Неопределено,
		РежимРегламентногоЗадания = Ложь) Экспорт
	
	ПараметрыОтображения = Новый Структура;
	ПараметрыОтображения.Вставить("ИдентификаторТестовогоПериода", ИдентификаторТестовогоПериода);
	ПараметрыОтображения.Вставить("Наименование",                  Наименование);
	ПараметрыОтображения.Вставить("ИдентификаторЗапроса",          ИдентификаторЗапроса);
	ПараметрыОтображения.Вставить("ИнформацияОбОшибке",            ОписаниеОшибки);
	ПараметрыОтображения.Вставить("СостояниеПодключения",          СостояниеПодключения);
	ПараметрыОтображения.Вставить("РежимРегламентногоЗадания",     РежимРегламентногоЗадания);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыОтображения", ПараметрыОтображения);
	ПараметрыФормы.Вставить("Идентификатор",        Идентификатор);
	ПараметрыФормы.Вставить("ОтобразитьРезультат",  Истина);
	
	Возврат ПараметрыФормы;
	
КонецФункции

#КонецОбласти
